Ran Plan for project: `animeutopia-prod` dir: `accounts/animeutopia-prod` workspace: `default`

<details><summary>Show Output</summary>

```diff
Wrote /home/atlantis/.atlantis/prod-ue2-animeutopia.tfvars with secrets from SSM.
Wrote /home/atlantis/.atlantis/nonprod-ue2-animeutopia.tfvars with secrets from SSM.
Wrote /home/atlantis/.atlantis/prod-ue2-sharedservices.tfvars with secrets from SSM.
Wrote /home/atlantis/.atlantis/nonprod-ue2-sharedservices.tfvars with secrets from SSM.


Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply" which may have affected this plan:

  # aws_lambda_function.render_video has changed
~ resource "aws_lambda_function" "render_video" {
      + arn                            = "arn:aws:lambda:us-east-2:481665084477:function:render_video"
        id                             = "render_video"
        # (10 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }


Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
~ update in-place
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # aws_iam_role_policy.step_functions_policy will be updated in-place
~ resource "aws_iam_role_policy" "step_functions_policy" {
        id          = "anime_step_functions_role:anime_step_functions_policy"
        name        = "anime_step_functions_policy"
      ~ policy      = jsonencode(
            {
              - Statement = [
                  - {
                      - Action   = [
                          - "lambda:InvokeFunction",
                        ]
                      - Effect   = "Allow"
                      - Resource = [
                          - "arn:aws:lambda:us-east-2:481665084477:function:fetch_rss",
                          - "arn:aws:lambda:us-east-2:481665084477:function:process_content",
                          - "arn:aws:lambda:us-east-2:481665084477:function:store_data",
                          - "arn:aws:lambda:us-east-2:481665084477:function:render_video",
                          - "arn:aws:lambda:us-east-2:481665084477:function:notify_post",
                        ]
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> (known after apply)
        # (2 unchanged attributes hidden)
    }

  # aws_lambda_function.render_video is tainted, so must be replaced
-/+ resource "aws_lambda_function" "render_video" {
      ~ architectures                  = [
          - "x86_64",
        ] -> (known after apply)
      ~ arn                            = "arn:aws:lambda:us-east-2:481665084477:function:render_video" -> (known after apply)
      ~ code_sha256                    = "09bc3c104b58d49e3018790da83efaafdbf219ef5b2a989b35a8a4be1127646e" -> (known after apply)
      ~ id                             = "render_video" -> (known after apply)
      ~ invoke_arn                     = "arn:aws:apigateway:us-east-2:lambda:path/2015-03-31/functions/arn:aws:lambda:us-east-2:481665084477:function:render_video/invocations" -> (known after apply)
      ~ last_modified                  = "2025-03-12T15:57:00.988+0000" -> (known after apply)
      - layers                         = [] -> null
      ~ qualified_arn                  = "arn:aws:lambda:us-east-2:481665084477:function:render_video:$LATEST" -> (known after apply)
      ~ qualified_invoke_arn           = "arn:aws:apigateway:us-east-2:lambda:path/2015-03-31/functions/arn:aws:lambda:us-east-2:481665084477:function:render_video:$LATEST/invocations" -> (known after apply)
      + signing_job_arn                = (known after apply)
      + signing_profile_version_arn    = (known after apply)
      + source_code_hash               = (known after apply)
      ~ source_code_size               = 0 -> (known after apply)
      - tags                           = {} -> null
      ~ version                        = "$LATEST" -> (known after apply)
        # (15 unchanged attributes hidden)

      ~ ephemeral_storage (known after apply)
      - ephemeral_storage {
          - size = 512 -> null
        }

      ~ logging_config (known after apply)
      - logging_config {
          - log_format            = "Text" -> null
          - log_group             = "/aws/lambda/render_video" -> null
            # (2 unchanged attributes hidden)
        }

      ~ tracing_config (known after apply)
      - tracing_config {
          - mode = "PassThrough" -> null
        }

        # (1 unchanged block hidden)
    }

  # aws_sfn_state_machine.anime_workflow will be updated in-place
~ resource "aws_sfn_state_machine" "anime_workflow" {
      ~ definition                = jsonencode(
            {
              - Comment = "State machine for automating anime post workflow with MoviePy"
              - StartAt = "FetchRSS"
              - States  = {
                  - CheckPost      = {
                      - Choices = [
                          - {
                              - Next         = "ProcessContent"
                              - StringEquals = "anime_post_found"
                              - Variable     = "$.rssData.status"
                            },
                        ]
                      - Default = "EndWorkflow"
                      - Type    = "Choice"
                    }
                  - EndWorkflow    = {
                      - Type = "Succeed"
                    }
                  - FetchRSS       = {
                      - Next       = "CheckPost"
                      - Resource   = "arn:aws:lambda:us-east-2:481665084477:function:fetch_rss"
                      - ResultPath = "$.rssData"
                      - Type       = "Task"
                    }
                  - NotifyUser     = {
                      - End        = true
                      - Resource   = "arn:aws:lambda:us-east-2:481665084477:function:notify_post"
                      - ResultPath = "$.notificationResult"
                      - Type       = "Task"
                    }
                  - ProcessContent = {
                      - Next       = "StoreData"
                      - Resource   = "arn:aws:lambda:us-east-2:481665084477:function:process_content"
                      - ResultPath = "$.processedContent"
                      - Type       = "Task"
                    }
                  - RenderVideo    = {
                      - Next       = "NotifyUser"
                      - Resource   = "arn:aws:lambda:us-east-2:481665084477:function:render_video"
                      - ResultPath = "$.videoResult"
                      - Type       = "Task"
                    }
                  - StoreData      = {
                      - Next       = "RenderVideo"
                      - Resource   = "arn:aws:lambda:us-east-2:481665084477:function:store_data"
                      - ResultPath = "$.storeResult"
                      - Type       = "Task"
                    }
                }
            }
        ) -> (known after apply)
        id                        = "arn:aws:states:us-east-2:481665084477:stateMachine:anime_workflow"
        name                      = "anime_workflow"
        tags                      = {}
        # (11 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

Plan: 1 to add, 2 to change, 1 to destroy.
```
</details>

* :arrow_forward: To **apply** this plan, comment:
  ```shell
  atlantis apply -p animeutopia-prod
  ```
* :put_litter_in_its_place: To **delete** this plan and lock, click [here](http://18.217.82.45:4141/lock?id=ryan-longoria%252FFeedMatrix%252Faccounts%252Fanimeutopia-prod%252Fdefault)
* :repeat: To **plan** this project again, comment:
  ```shell
  atlantis plan -p animeutopia-prod
  ```

**Note: Objects have changed outside of Terraform**
Plan: 1 to add, 2 to change, 1 to destroy.

---
* :fast_forward: To **apply** all unapplied plans from this Pull Request, comment:
  ```shell
  atlantis apply
  ```
* :put_litter_in_its_place: To **delete** all plans and locks from this Pull Request, comment:
  ```shell
  atlantis unlock
  ```